# Rebar Shape Is Same Shape Ignoring Terminations Method

Source: https://www.revitapidocs.com/2026/5db9cdfe-9e7d-b6f5-9a81-563602eb45d6.htm

---

| Rebar Shape Is Same Shape Ignoring Terminations Method |
| --- |

Test whether two shapes have equivalent definitions by comparing
 the RebarShapeDefinition and MultiplanarDefinition properties.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool IsSameShapeIgnoringTerminations(
	RebarShape otherShape
)
```

```
Public Function IsSameShapeIgnoringTerminations (
	otherShape As RebarShape
) As Boolean
```

```
public:
bool IsSameShapeIgnoringTerminations(
	RebarShape^ otherShape
)
```

```
member IsSameShapeIgnoringTerminations :
        otherShape : RebarShape -> bool
```

#### Parameters

otherShape RebarShape
:   Another shape to be compared to this one.

#### Return Value

Boolean
True if the shape definitions match, false otherwise. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

Remarks This method will return true if the definitions are exactly equivalent.
 The hooks, cranks, end treatments, orientations and terminations' rotation angles are ignored. See Also

#### Reference

RebarShape Class Autodesk.Revit.DB.Structure Namespace